//Лабораторная 2, задача 8. Выполнена: Воднев Д. И.

/*
    Вычислить значение y в зависимости от выбранной функции f(x),
    аргумент определяется из поставленного условия. Возможные значения
    функции f(x): 2x, x^3, x/3 (выбор осуществляется используя оператор switch).
    Предусмотреть вывод сообщений, показывающих, при каком условии и с какой
    функцией производились вычисления y.

    Мой номер в журнале 5
*/

#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "Rus");

    return 0;
}
